In [2]:
import pandas as pd
df = pd.read_csv("./assets/Students_exams.csv")
df

    gender;math score;reading score;writing score
0                                 female;72;72;74
1                                 female;69;90;88
2                                 female;90;95;93
3                                   male;47;57;44
4                                   male;76;78;75
..                                            ...
995                               female;88;99;95
996                                 male;62;55;55
997                               female;59;71;65
998                               female;68;78;77
999                               female;77;86;86

[1000 rows x 1 columns]

In [3]:
import pandas as pd
df = pd.read_csv("./assets/Students_exams.csv", sep=";")
df

     gender  math score  reading score  writing score
0    female          72             72             74
1    female          69             90             88
2    female          90             95             93
3      male          47             57             44
4      male          76             78             75
..      ...         ...            ...            ...
995  female          88             99             95
996    male          62             55             55
997  female          59             71             65
998  female          68             78             77
999  female          77             86             86

[1000 rows x 4 columns]

In [3]:
import pandas as pd
df = pd.read_csv("./assets/Students_exams.csv", sep=";")
df.shape

(1000, 4)

In [6]:
df = pd.read_csv("./assets/Students_exams.csv", sep=";", usecols=["math score", "reading score"])
df

     math score  reading score
0            72             72
1            69             90
2            90             95
3            47             57
4            76             78
..          ...            ...
995          88             99
996          62             55
997          59             71
998          68             78
999          77             86

[1000 rows x 2 columns]

In [7]:
df = pd.read_csv("./assets/Students_exams.csv", sep=";", usecols=["math score", "reading score"], nrows= 100)
df

    math score  reading score
0           72             72
1           69             90
2           90             95
3           47             57
4           76             78
..         ...            ...
95          78             81
96          65             66
97          63             72
98          58             67
99          65             67

[100 rows x 2 columns]

In [9]:
df = pd.read_csv("./assets/Students_exams.csv", sep=";")
df

     gender  math score  reading score  writing score
0    female          72             72             74
1    female          69             90             88
2    female          90             95             93
3      male          47             57             44
4      male          76             78             75
..      ...         ...            ...            ...
995  female          88             99             95
996    male          62             55             55
997  female          59             71             65
998  female          68             78             77
999  female          77             86             86

[1000 rows x 4 columns]

In [10]:
df.head()

   gender  math score  reading score  writing score
0  female          72             72             74
1  female          69             90             88
2  female          90             95             93
3    male          47             57             44
4    male          76             78             75

In [11]:
df.head(10)

   gender  math score  reading score  writing score
0  female          72             72             74
1  female          69             90             88
2  female          90             95             93
3    male          47             57             44
4    male          76             78             75
5  female          71             83             78
6  female          88             95             92
7    male          40             43             39
8    male          64             64             67
9  female          38             60             50

In [12]:
df.tail()

     gender  math score  reading score  writing score
995  female          88             99             95
996    male          62             55             55
997  female          59             71             65
998  female          68             78             77
999  female          77             86             86

In [13]:
df.tail(10)

     gender  math score  reading score  writing score
990    male          86             81             75
991  female          65             82             78
992  female          55             76             76
993  female          62             72             74
994    male          63             63             62
995  female          88             99             95
996    male          62             55             55
997  female          59             71             65
998  female          68             78             77
999  female          77             86             86

In [15]:
df = pd.read_csv("./assets/Students_no_cols.csv", sep=";")
df

     female  69  90  88
0    female  90  95  93
1      male  47  57  44
2      male  76  78  75
3    female  71  83  78
4    female  88  95  92
..      ...  ..  ..  ..
993  female  88  99  95
994    male  62  55  55
995  female  59  71  65
996  female  68  78  77
997  female  77  86  86

[998 rows x 4 columns]

In [16]:
header_names = ["A", "B", "C", "D"]
df = pd.read_csv("./assets/Students_no_cols.csv", sep=";", names=header_names)
df

          A   B   C   D
0    female  69  90  88
1    female  90  95  93
2      male  47  57  44
3      male  76  78  75
4    female  71  83  78
..      ...  ..  ..  ..
994  female  88  99  95
995    male  62  55  55
996  female  59  71  65
997  female  68  78  77
998  female  77  86  86

[999 rows x 4 columns]